tutorials/bent_pipe/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|Phi)"
    {
        solver          GAMG;
        tolerance       1e-9;
        relTol          0.005;
        smoother        FDIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration      on;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        processorAgglomerator   procFaces;
        nAgglomeratingCells     400;
        mergeLevels             1;
    }
    
    pFinal
    {
        solver          GAMG;
        tolerance       1e-12;
        relTol          0;
        smoother        FDIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration      on;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        processorAgglomerator   procFaces;
        nAgglomeratingCells     400;
    }

    "(U|k|omega|epsilon)"
    {
        solver          GAMG;
        tolerance       1e-12;
        relTol          0.01;
        smoother       	DILU;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration      on;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        processorAgglomerator   procFaces;
        nAgglomeratingCells     400;
        mergeLevels             1;
    }
    
    UFinal
    {
        solver          GAMG;
        tolerance       1e-11;
        relTol          0;
        smoother        DILU;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration      on;
        nCellsInCoarsestLevel   10;
        agglomerator            faceAreaPair;
        processorAgglomerator   procFaces;
        nAgglomeratingCells     400;
        mergeLevels             1;
    }

}


PIMPLE
{
    momentumPredictor   true;
    nOuterCorrectors    3;
    nCorrectors         2;
    nNonOrthogonalCorrectors 3;
    pRefCell 1001;
    pRefValue 0;
    
    outerCorrectorResidualControl
    {
	p
	{
	    tolerance   1e-7;
	    relTol      0;
	}
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes; //I changed this
    
    residualControl
    {
        p           1e-5;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 12;
}

relaxationFactors
{
    fields
    {
        p           0.2;
        U           0.5;
        k           0.8;
        omega       0.8;
    }
    equations
    {
        ".*" 0.85;
    }
}

PISO
{
    momentumPredictor true;
    nCorrectors     6;
    nNonOrthogonalCorrectors 2;
    pRefCell        1001;
    pRefValue       0;
}
// ************************************************************************* //
